<a href="https://colab.research.google.com/github/Josephat-Onkoba/Learning-HTML-CSS-PHP-SQL-/blob/main/Introduction_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Getting Started
Before you begin, set up by importing the Python `sqlite3` library which will enable you to work with SQL in Python. You will also create a connection to a database, and then create a cursor object to run SQL queries. In real-world scenarios, you will connect to an actual database such as PostgreSQL, MySQL, MongoDB, etc. However, for this workshop, you will make use of an in-memory database.

You will use the following template:
```
# Execute the SQL code
cursor.execute('''INPUT_YOUR_SQL_CODE_HERE
''')

# Output the result
results = cursor.fetchall()
for row in results:
    print(row)
```

Once you are done, it is always good practice to close both the cursor and the connection at the end.
```
# Close cursor and connection (always do this when you are done)
cursor.close()
conn.close()
```

In [ ]:
# Import sqlite3 library
import sqlite3

# Create connection to in-memory database
conn = sqlite3.connect(':memory:')

# Create cursor object to run SQL queries
cursor = conn.cursor()

# CREATE TABLE

In [ ]:
# Create a table called "Students"
cursor.execute('''
    CREATE TABLE Students (
        ID INTEGER PRIMARY KEY,
        Name TEXT,
        Age INTEGER,
        Grade TEXT
    )
''')

## Challenge

Create a table called `Employees` that has the following fields:
* EmpID (employee ID number): integer, primary key
* FName (employee first name): text
* LName (employee last name): text
* Role: (the employee's current role): text (can be Administrator, Assistant, Developer, and Manager)
* Salary (how much employee earns): integer

In [ ]:
# Hint
CREATE TABLE Employees (
    EmpID INTEGER PRIMARY KEY,
    FName TEXT,
    LName TEXT,
    Role TEXT,
    Salary INTEGER
)

# INSERT INTO

In [ ]:
# Insert sample data into the table
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('John', 18, 'A')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Jane', 19, 'B')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Mark', 17, 'C')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Emily', 20, 'A')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Sarah', 19, 'B')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Michael', 20, 'A')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Sophia', 18, 'A')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('William', 19, 'B')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Olivia', 21, 'A')")
cursor.execute("INSERT INTO Students (Name, Age, Grade) VALUES ('Ethan', 20, 'C')")

## Challenge

Insert at most 10 records into that table.

In [ ]:
# Hint
INSERT INTO Employees (EmpID, FName, LName, Role, Salary)
VALUES
    (1, 'John', 'Doe', 'Manager', 50000),
    (2, 'Jane', 'Smith', 'Developer', 35000),
    (3, 'Michael', 'Johnson', 'Developer', 45000),
    (4, 'Emily', 'Brown', 'Administrator', 40000),
    (5, 'William', 'Davis', 'Manager', 30000),
    (6, 'Olivia', 'Miller', 'Assistant', 38000),
    (7, 'James', 'Wilson', 'Assistant', 55000),
    (8, 'Sophia', 'Taylor', 'Manager', 32000),
    (9, 'Daniel', 'Anderson', 'Administrator', 48000),
    (10, 'Ava', 'Thomas', 'Developer', 36000)

# SELECT

In [ ]:
# Execute a SELECT query to retrieve all records from the "Students" table
cursor.execute("SELECT * FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Retrieve all the records.

In [ ]:
# Hint
SELECT * FROM Employees

# SELECT DISTINCT

In [ ]:
# Execute a SELECT query to retrieve distinct grades
cursor.execute("SELECT DISTINCT Grade FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Retrieve the distinct roles from the Employees table.

In [ ]:
# Hint
SELECT DISTINCT Role FROM Employees;

# WHERE

In [ ]:
# Execute a SELECT query with a WHERE clause to retrieve Emily's record
cursor.execute("SELECT * FROM Students WHERE Name = 'Emily'")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Use the WHERE clause to retrieve all managers.

In [ ]:
# Hint
SELECT * FROM Employees WHERE Role = 'Manager'

# AND, OR, NOT

In [ ]:
# Execute a SELECT query with the AND operator
cursor.execute("SELECT * FROM Students WHERE Grade = 'A' AND Age > 20")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query with the OR operator
cursor.execute("SELECT * FROM Students WHERE Grade = 'A' OR Age < 20")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query with the NOT operator
cursor.execute("SELECT * FROM Students WHERE NOT Grade = 'A'")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Retrieve all the records where the managers are earning more than 50000.

In [ ]:
# Hint
SELECT * FROM Employees WHERE Role = 'Manager' AND Salary > 50000

## Challenge

Retrieve all the records where the employee is either an assistant or earning less than or equal to 35000.

In [ ]:
# Hint
SELECT * FROM Employees WHERE Role = 'Assistant' OR Salary <= 35000

## Challenge

Retrieve all the records where the employees aren't Administrators.

In [ ]:
# Hint
SELECT * FROM Employees WHERE NOT Role = 'Administrator'

# ORDER BY

In [ ]:
# Execute a SELECT query to retrieve names and order them in ascending order
cursor.execute("SELECT Name FROM Students ORDER BY Name")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query to retrieve names and order them in descending order
cursor.execute("SELECT Name FROM Students ORDER BY Name DESC")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Retrieve all records and display them in decreasing order of last names.

In [ ]:
# Hint
SELECT * FROM Employees ORDER BY LName DESC

# UPDATE

In [ ]:
# Update the record with ID = 2 in the "Students" table
cursor.execute("UPDATE Students SET Grade = 'A' WHERE ID = 2")

# Fetch all records from the "Students" table after the update
cursor.execute("SELECT * FROM Students")
records = cursor.fetchall()
print("\nRecords after update:")
for record in records:
    print(record)

## Challenge

Update a record of your choice to change its salary.

In [ ]:
# Hint
UPDATE Employees SET Salary = 72000 WHERE EmpId = 5

# DELETE

In [ ]:
# Delete the record with ID = 1 from the "Students" table
cursor.execute("DELETE FROM Students WHERE ID = 1")

# Fetch all records from the "Students" table after the deletion
cursor.execute("SELECT * FROM Students")
records = cursor.fetchall()
print("\nRecords after deletion:")
for record in records:
    print(record)

## Challenge

Delete a record of your choice.

In [ ]:
# Hint
DELETE FROM Employees WHERE EmpId = 5

# MIN & MAX

In [ ]:
# Execute a SELECT query to retrieve the minimum age
cursor.execute("SELECT MIN(Age) FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query to retrieve the maximum age
cursor.execute("SELECT MAX(Age) FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Use the MIN function to retrieve the minimum salary in the database.

In [ ]:
# Hint
SELECT MIN(Salary) FROM Employees;

## Challenge

Use the MAX function to retrieve the maximum salary in the database.

In [ ]:
# Hint
SELECT MAX(Salary) FROM Employees;

# COUNT, AVG, SUM

In [ ]:
# Execute a SELECT query to count all records
cursor.execute("SELECT COUNT(*) FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query to calculate the average age
cursor.execute("SELECT AVG(Age) FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query to calculate the sum of ages
cursor.execute("SELECT SUM(Age) FROM Students")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Count the number of employees in your table.

In [ ]:
# Hint
SELECT COUNT(*) FROM Employees

## Challenge
Calculate the average salary of the Employees table.

In [ ]:
# Hint
SELECT AVG(Salary) FROM Employees

## Challenge

Calculate the total salary for the whole table.

In [ ]:
# Hint
SELECT SUM(Salary) FROM Employees

# GROUP BY

In [ ]:
# Execute a SELECT query with GROUP BY clause
cursor.execute("SELECT Grade, COUNT(*) FROM Students GROUP BY Grade")

# Fetch all records grouped by grade
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Use the GROUP BY function to calculate the number of employees per job role.

In [ ]:
# Hint
SELECT Role, COUNT(*) FROM Employees GROUP BY Role

# LIKE

In [ ]:
# Execute a SELECT query with the LIKE operator and % wildcard
cursor.execute("SELECT * FROM Students WHERE Name LIKE 'S%'")

# Fetch all records that satisfy the condition
records = cursor.fetchall()

# Print the selected records
print("Records matching the condition (Name starts with 'S'):")
for record in records:
    print(record)

In [ ]:
# Execute a SELECT query with the LIKE operator and _ wildcard
cursor.execute("SELECT * FROM Students WHERE Name LIKE '_a__'")

# Fetch all records that satisfy the condition
records = cursor.fetchall()

# Print the selected records
print("Records matching the condition (Name has 4 characters and 2nd character is 'a'):")
for record in records:
    print(record)

## Challenge

Return records where the employee's first name has 5 letters.

In [ ]:
# Hint
SELECT * FROM Employees WHERE FName LIKE '____'

# BETWEEN

In [ ]:
# Execute a SELECT query with the BETWEEN operator
cursor.execute("SELECT * FROM Students WHERE Age BETWEEN 18 AND 20")

# Fetch all the records
records = cursor.fetchall()

# Print the fetched records
for record in records:
    print(record)

## Challenge

Based on the values you selected, retrieve all records with salaries that within your desired range.

In [ ]:
# Hint
SELECT * FROM Employees WHERE Salary BETWEEN 35000 AND 45000

# Bonus Challenges

Think you've mastered SQL basics? Below are some extra challenges for you to solve. We have made them more challenging to test your SQL prowess.

1. Retrieve all records where the role isn't that of an Administrator and a Manager.
2. List all developers in decreasing order of their salaries.
3. Calculate the average salary per role and order in increasing order of role.
4. Delete all employees that are assistants.
5. Select the employees whose salary is greater than the average salary of all employees.

In [ ]:
# Hints
# 1.
SELECT * FROM Employees WHERE NOT Role = 'Administrator' AND NOT Role = Manager

# 2.
SELECT * FROM Employees WHERE Role = 'Developer' ORDER BY Salary DESC

# 3.
SELECT Role, AVG(Salary) FROM Employees GROUP BY Role ORDER BY Role

# 4.
DELETE FROM Employees WHERE Role = 'Assistant'

# 5.
SELECT * FROM Employees WHERE Salary > (SELECT AVG(Salary) FROM Employees)

# Closing the cursor & connection

In [ ]:
# Close cursor and connection (always do this when you are done)
cursor.close()
conn.close()